In [1]:
pwd

'C:\\Users\\HP\\PAVILION\\ML_COURSE\\PYTHON\\pandas_library'

In [85]:
import pandas as pd
df = pd.read_csv("weather_data.csv")

In [86]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [87]:
# dimensions:
rows, columns = df.shape # 6 -> rows, 4 -> columns

In [88]:
rows

6

In [89]:
columns

4

In [90]:
# this prints only few rows from ur df
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [91]:
df.head(2)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [92]:
# this is gives output from the last of df:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [93]:
df.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [94]:
# slicing:
df[1::2]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
3  1/4/2017           24          7   Snow
5  1/6/2017           31          2  Sunny

In [95]:
# print column names:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [96]:
# print individual rows:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [26]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [28]:
df["temperature"] # we can use in this way or above type

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [29]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [30]:
# print only event and day from df:
df[["day","event"]]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [31]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [35]:
# what is the maximum temp in the data frame:
df.temperature.max()

35

In [36]:
# what s the minimum temperature in data frame:
df.temperature.min()

24

In [39]:
# check wether there are any duplicates in data frame:
df.temperature.is_unique

False

In [44]:
# print count of values in data frame:
df.temperature.value_counts()

32    2
35    1
28    1
24    1
31    1
Name: temperature, dtype: int64

In [45]:
# print the mean of temperature:
df.temperature.mean()

30.333333333333332

In [46]:
# print standard deviation of temperature:
df.temperature.std()

3.8297084310253524

In [48]:
# this prints the statistics of the data frame:

df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [51]:
# print the temperatures which are greater than or equals to 32:
df[df.temperature>=32]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [53]:
# observe the difference between from above:
df.temperature>=32

0     True
1     True
2    False
3    False
4     True
5    False
Name: temperature, dtype: bool

In [54]:
# maximum temperature :
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [62]:
# print day,temperature in data frame which is maximum temperature:
df[["day","temperature"]][df.temperature == df.temperature.max()]

        day  temperature
1  1/2/2017           35

In [63]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [64]:
# change day as ur index:
df.set_index("day")

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [67]:
# observe the difference from above:
# that doesnt reflect to original df
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [68]:
# to reflect original one:
df.set_index("day",inplace = True)

In [69]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [71]:
# now get any temp using day as index:
df.loc["1/1/2017"]

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

In [72]:
# get the data frame as original one :
df.reset_index(inplace = True)

In [75]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [81]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [99]:
# .loc function is used only with indexing. refer to df.loc["1/1/2017"]